Revit 2027 API
ParameterTypeId.MepSegmentElementTypename Property
 "Type Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MepSegmentElementTypename { get; }
Public Shared ReadOnly Property MepSegmentElementTypename As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MepSegmentElementTypename {
	ForgeTypeId^ get ();
}
static member MepSegmentElementTypename : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace